/* ============================================================
   Отзываем права
   ============================================================ */

REVOKE EXECUTE ON PROCEDURE MRV_GPRI FROM USER MRV;

REVOKE USAGE ON EXCEPTION EX_BAD_PERIOD FROM USER MRV;
REVOKE USAGE ON EXCEPTION EX_PERIOD_TOO_LONG FROM USER MRV;

/* ============================================================
   Удаляем процедуру
   ============================================================ */

DROP PROCEDURE MRV_GPRI;

/* ============================================================
   Удаляем исключения
   ============================================================ */

DROP EXCEPTION EX_BAD_PERIOD;
DROP EXCEPTION EX_PERIOD_TOO_LONG;

/* ============================================================
   Удаляем пользователя
   ============================================================ */

DROP USER MRV;